Revit 2027 API
Wave.WavePhase Property
 The property labeled "Phase" from the "Wave" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string WavePhase { get; }
Public Shared ReadOnly Property WavePhase As String
	Get
public:
static property String^ WavePhase {
	String^ get ();
}
static member WavePhase : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble" within the range of "0, 10000".
See Also
Reference
Wave Class
Autodesk.Revit.DB.Visual Namespace